from solution import *
from main0 import run_test

##########코테 보기전 화장실
##########코테 보기전 화장실
##########코테 보기전 화장실
if __name__ == '__main__':
    testcases = [
        [5,["100 1 3","500 4", "2000 5"],["300 3 5", "1500 1", "100 1 3","50 12"]],
        [300000,
         [' '.join(map(str,[3000*i+1,i+1])) for i in range(300000)],
         [str(3000*(300000-1))+" 2","1000000000 1","500 300001",
          "1 300000","1 1"]*10000],
        [5,["1 2 4","200 1 3"],["1 1","5000 3"]]
    ]
    expectations = [
        [3,3,1,0],
        [300000,0,0,300000,1]*10000,
        [2,0]
    ]
    run_test(testcases,expectations,solution)